# 实验A: 基线YOLOv8n
# ============================================
# 骨干网络：标准0-9层（Conv, C2f, SPPF）
# 颈部：标准PANet
# 检测头：3个输入（P3, P4, P5）

# Parameters
nc: 4  # number of classes (car, bus, van, truck)
depth_multiple: 1.0
width_multiple: 1.0

# YOLOv8n backbone (层0-9)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2, 输入3通道, 输出64通道, 步距2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4, 步距2
  - [-1, 3, C2f, [128, True]]    # 2-通道128, 3个Bottleneck
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8, 步距2
  - [-1, 6, C2f, [256, True]]    # 4-输出P3(256通道, 1/8分辨率)
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16, 步距2
  - [-1, 6, C2f, [512, True]]    # 6-输出P4(512通道, 1/16分辨率)
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32, 步距2
  - [-1, 3, C2f, [1024, True]]   # 8-通道1024, 3个Bottleneck
  - [-1, 1, SPPF, [1024, 5]]     # 9-输出P5(1024通道, 1/32分辨率)

# PANet neck + Detection head (层10-22)
head:
  # ===== 自底向上路径 (Top-down) =====
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10-上采样2倍, 对层9(P5)上采样
  - [[-1, 6], 1, Concat, [1]]  # 11-拼接backbone层6(P4), 输出512+512=1024
  - [-1, 3, C2f, [512]]        # 12-融合后C2f, 输出512

  # 继续上采样
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13-上采样2倍
  - [[-1, 4], 1, Concat, [1]]   # 14-拼接backbone层4(P3), 输出256+256=512
  - [-1, 3, C2f, [256]]         # 15-P3输出, 256通道 ★检测输入1

  # ===== 自顶向下路径 (Bottom-up) =====
  - [-1, 1, Conv, [256, 3, 2]]   # 16-下采样2倍
  - [[-1, 12], 1, Concat, [1]]   # 17-拼接层12, 输出256+512=768
  - [-1, 3, C2f, [512]]          # 18-P4输出, 512通道 ★检测输入2

  - [-1, 1, Conv, [512, 3, 2]]   # 19-下采样2倍
  - [[-1, 9], 1, Concat, [1]]    # 20-拼接backbone层9(P5), 输出512+1024=1536
  - [-1, 3, C2f, [1024]]         # 21-P5输出, 1024通道 ★检测输入3

  # Detection head
  - [[15, 18, 21], 1, Detect, [4]]  # 22-接收P3(15), P4(18), P5(21), nc=4

# ============== 层索引映射表 ==============
# Backbone (0-9):
#   层0: Conv(P1/2)        -> 64通道, 1/2分辨率
#   层1: Conv(P2/4)        -> 128通道, 1/4分辨率
#   层2: C2f(n=3)          -> 128通道
#   层3: Conv(P3/8)        -> 256通道, 1/8分辨率
#   层4: C2f(n=6, 输出P3)  -> 256通道, 1/8分辨率  ★P3特征 (80x80@640)
#   层5: Conv(P4/16)       -> 512通道, 1/16分辨率
#   层6: C2f(n=6, 输出P4)  -> 512通道, 1/16分辨率 ★P4特征 (40x40@640)
#   层7: Conv(P5/32)       -> 1024通道, 1/32分辨率
#   层8: C2f(n=3)          -> 1024通道
#   层9: SPPF(输出P5)      -> 1024通道, 1/32分辨率 ★P5特征 (20x20@640)
#
# Neck/Head (10-22):
#   层10: nn.Upsample      -> P5上采样到1/16
#   层11: Concat(6)        -> 拼接P4
#   层12: C2f(n=3)         -> 融合特征, 512通道
#   层13: nn.Upsample      -> 上采样到1/8
#   层14: Concat(4)        -> 拼接P3
#   层15: C2f(n=3, P3-out) -> 256通道 ★检测头输入1 (80x80)
#   层16: Conv             -> 下采样到1/16
#   层17: Concat(12)       -> 拼接层12
#   层18: C2f(n=3, P4-out) -> 512通道 ★检测头输入2 (40x40)
#   层19: Conv             -> 下采样到1/32
#   层20: Concat(9)        -> 拼接P5
#   层21: C2f(n=3, P5-out) -> 1024通道 ★检测头输入3 (20x20)
#   层22: Detect([15,18,21]) -> 检测头, nc=4
