# 实验B: CBAM注意力机制
# ============================================
# 骨干网络：标准0-9层（Conv, C2f, SPPF）
# 颈部：在PANet开始前，对P3、P4、P5分别应用CBAM
# 检测头：3个输入（CBAM增强后的P3, P4, P5）

# Parameters
nc: 4  # number of classes (car, bus, van, truck)
depth_multiple: 1.0
width_multiple: 1.0

# YOLOv8n backbone (层0-9)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2, 输入3通道, 输出64通道, 步距2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4, 步距2
  - [-1, 3, C2f, [128, True]]    # 2-通道128, 3个Bottleneck
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8, 步距2
  - [-1, 6, C2f, [256, True]]    # 4-输出P3(256通道, 1/8分辨率)
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16, 步距2
  - [-1, 6, C2f, [512, True]]    # 6-输出P4(512通道, 1/16分辨率)
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32, 步距2
  - [-1, 3, C2f, [1024, True]]   # 8-通道1024, 3个Bottleneck
  - [-1, 1, SPPF, [1024, 5]]     # 9-输出P5(1024通道, 1/32分辨率)

# PANet neck + CBAM + Detection head (层10-25)
head:
  # ===== CBAM注意力层 (层10-12) =====
  # 在颈部开始前，对骨干网络输出的P3、P4、P5分别应用CBAM
  # CBAM: 单输入，输出通道不变 (c1=c2)
  - [4, 1, CBAM, [256]]     # 10-对层4(P3)应用CBAM, 输入256通道, 输出256通道
  - [6, 1, CBAM, [512]]     # 11-对层6(P4)应用CBAM, 输入512通道, 输出512通道
  - [9, 1, CBAM, [1024]]    # 12-对层9(P5)应用CBAM, 输入1024通道, 输出1024通道

  # ===== 自底向上路径 (Top-down) =====
  # 注意：现在拼接的是CBAM增强后的特征 (层11和层12)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13-上采样2倍, 对层12(CBAM_P5)上采样
  - [[-1, 11], 1, Concat, [1]]  # 14-拼接CBAM增强的P4(层11), 输出512+512=1024
  - [-1, 3, C2f, [512]]         # 15-融合后C2f, 输出512

  # 继续上采样
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16-上采样2倍
  - [[-1, 10], 1, Concat, [1]]   # 17-拼接CBAM增强的P3(层10), 输出256+256=512
  - [-1, 3, C2f, [256]]          # 18-CBAM_P3输出, 256通道 ★检测输入1

  # ===== 自顶向下路径 (Bottom-up) =====
  - [-1, 1, Conv, [256, 3, 2]]   # 19-下采样2倍
  - [[-1, 15], 1, Concat, [1]]   # 20-拼接层15, 输出256+512=768
  - [-1, 3, C2f, [512]]          # 21-P4输出, 512通道 ★检测输入2

  - [-1, 1, Conv, [512, 3, 2]]   # 22-下采样2倍
  - [[-1, 12], 1, Concat, [1]]   # 23-拼接CBAM_P5(层12), 输出512+1024=1536
  - [-1, 3, C2f, [1024]]         # 24-P5输出, 1024通道 ★检测输入3

  # Detection head
  - [[18, 21, 24], 1, Detect, [4]]  # 25-接收CBAM_P3(18), P4(21), P5(24), nc=4

# ============== 层索引映射表 ==============
# Backbone (0-9):
#   层0: Conv(P1/2)        -> 64通道, 1/2分辨率
#   层1: Conv(P2/4)        -> 128通道, 1/4分辨率
#   层2: C2f(n=3)          -> 128通道
#   层3: Conv(P3/8)        -> 256通道, 1/8分辨率
#   层4: C2f(n=6, 输出P3)  -> 256通道, 1/8分辨率 ★原始P3
#   层5: Conv(P4/16)       -> 512通道, 1/16分辨率
#   层6: C2f(n=6, 输出P4)  -> 512通道, 1/16分辨率 ★原始P4
#   层7: Conv(P5/32)       -> 1024通道, 1/32分辨率
#   层8: C2f(n=3)          -> 1024通道
#   层9: SPPF(输出P5)      -> 1024通道, 1/32分辨率 ★原始P5
#
# Neck/Head (10-25):
#   层10: CBAM(P3)         -> 256通道, 1/8分辨率 ★CBAM增强的P3
#   层11: CBAM(P4)         -> 512通道, 1/16分辨率 ★CBAM增强的P4
#   层12: CBAM(P5)         -> 1024通道, 1/32分辨率 ★CBAM增强的P5
#   层13: nn.Upsample      -> CBAM_P5上采样到1/16
#   层14: Concat(11)       -> 拼接CBAM_P4
#   层15: C2f(n=3)         -> 融合特征, 512通道
#   层16: nn.Upsample      -> 上采样到1/8
#   层17: Concat(10)       -> 拼接CBAM_P3
#   层18: C2f(n=3, P3-out) -> 256通道 ★检测头输入1 (80x80)
#   层19: Conv             -> 下采样到1/16
#   层20: Concat(15)       -> 拼接层15
#   层21: C2f(n=3, P4-out) -> 512通道 ★检测头输入2 (40x40)
#   层22: Conv             -> 下采样到1/32
#   层23: Concat(12)       -> 拼接CBAM_P5
#   层24: C2f(n=3, P5-out) -> 1024通道 ★检测头输入3 (20x20)
#   层25: Detect([18,21,24]) -> 检测头, nc=4
