# 实验C: BiFPN双向特征金字塔 (简化版)
# ============================================
# 骨干网络：标准0-9层（Conv, C2f, SPPF）
# 颈部：3尺度BiFPN（P3, P4, P5）
# 检测头：1个Detect层，接收三个特征（P3, P4, P5）

# Parameters
nc: 4
depth_multiple: 1.0
width_multiple: 1.0

# YOLOv8n backbone (层0-9)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 3, C2f, [128, True]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 6, C2f, [256, True]]    # 4-P3 (80x80)
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16
  - [-1, 6, C2f, [512, True]]    # 6-P4 (40x40)
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]   # 8
  - [-1, 1, SPPF, [1024, 5]]     # 9-P5 (20x20)

# BiFPN neck
head:
  # ===== 自顶向下 =====
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10-P5->40x40
  - [[-1, 6], 1, Concat, [1]]   # 11-P4+P5_up
  - [-1, 3, C2f, [512]]         # 12-P4_td (40x40)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13-P4_td->80x80
  - [[-1, 4], 1, Concat, [1]]   # 14-P3+P4_td
  - [-1, 3, C2f, [256]]         # 15-P3_td (80x80)

  # ===== 自底向上 =====
  - [15, 1, Conv, [256, 1, 1]]   # 16-P3_out (80x80)

  - [-1, 1, Conv, [512, 3, 2]]  # 17-P3_out下采样->40x40
  - [[-1, 12], 1, Concat, [1]]  # 18-P4_td+P3_down (40x40+40x40)
  - [-1, 3, C2f, [512]]         # 19-P4_out (40x40)

  - [-1, 1, Conv, [1024, 3, 2]] # 20-P4_out下采样->20x20
  - [[-1, 9], 1, Concat, [1]]   # 21-P5+P4_down (20x20+20x20)
  - [-1, 3, C2f, [1024]]        # 22-P5_out (20x20)

  # Detection: 3个输入
  - [[16, 19, 22], 1, Detect, [4]]  # 23

# 层索引:
# Backbone: 0-9
#   4=P3, 6=P4, 9=P5
# Neck: 10-23
#   10=Upsample, 11=Concat, 12=P4_td
#   13=Upsample, 14=Concat, 15=P3_td
#   16=P3_out (检测输入1)
#   17=Conv, 18=Concat, 19=P4_out (检测输入2)
#   20=Conv, 21=Concat, 22=P5_out (检测输入3)
#   23=Detect([16,19,22])